; ModuleID = 'rust_interp.8v83d8ah-cgu.0'
source_filename = "rust_interp.8v83d8ah-cgu.0"
target datalayout = "e-m:e-p:32:32-p270:32:32-p271:32:32-p272:64:64-f64:32:64-f80:32-n8:16:32-S128"
target triple = "i686-unknown-linux-gnu"

%Token = type { [0 x i8], i8, [9 x i8] }
%"arrayvec::ArrayVec<[Token; 16]>" = type { [0 x i8], %"arrayvec::maybe_uninit::MaybeUninit<[Token; 16]>", [0 x i8], i8, [0 x i8] }
%"arrayvec::maybe_uninit::MaybeUninit<[Token; 16]>" = type { [0 x i8], %"core::mem::maybe_uninit::MaybeUninit<[Token; 16]>", [0 x i8] }
%"core::mem::maybe_uninit::MaybeUninit<[Token; 16]>" = type { [160 x i8] }

@alloc69 = private unnamed_addr constant <{ [6 x i8] }> <{ [6 x i8] c"ident:" }>, align 1
@alloc117 = private unnamed_addr constant <{ [1 x i8] }> <{ [1 x i8] c")" }>, align 1
@alloc109 = private unnamed_addr constant <{ [1 x i8] }> <{ [1 x i8] c"(" }>, align 1
@alloc101 = private unnamed_addr constant <{ [1 x i8] }> <{ [1 x i8] c"}" }>, align 1
@alloc93 = private unnamed_addr constant <{ [1 x i8] }> <{ [1 x i8] c"{" }>, align 1
@alloc85 = private unnamed_addr constant <{ [1 x i8] }> <{ [1 x i8] c"]" }>, align 1
@alloc77 = private unnamed_addr constant <{ [1 x i8] }> <{ [1 x i8] c"[" }>, align 1
@alloc10 = private unnamed_addr constant <{ [8 x i8] }> <{ [8 x i8] c"tokens3:" }>, align 1
@alloc11 = private unnamed_addr constant <{ [7 x i8] }> <{ [7 x i8] c"tokens:" }>, align 1

; rust_interp::Token::print_self
; Function Attrs: nounwind nonlazybind

!10 = !DINamespace(name: "core", scope: null)
!11 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!12 = !{!13, !14}
!13 = !DIEnumerator(name: "Ok", value: 0)
!14 = !DIEnumerator(name: "Err", value: 1)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !16, file: !8, baseType: !11, size: 8, align: 8, flags: DIFlagEnumClass, elements: !19)
!16 = !DINamespace(name: "v1", scope: !17)
!17 = !DINamespace(name: "rt", scope: !18)
!18 = !DINamespace(name: "fmt", scope: !10)
!19 = !{!20, !21, !22, !23}
!20 = !DIEnumerator(name: "Left", value: 0)
!21 = !DIEnumerator(name: "Right", value: 1)
!22 = !DIEnumerator(name: "Center", value: 2)
!23 = !DIEnumerator(name: "Unknown", value: 3)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "McBlock", scope: !25, file: !8, baseType: !26, size: 32, align: 32, flags: DIFlagEnumClass, elements: !27)
!25 = !DINamespace(name: "rust_interp", scope: null)
!26 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!28 = !DIEnumerator(name: "Air", value: 0)
!29 = !DIEnumerator(name: "Cobblestone", value: 1)
!30 = !DIEnumerator(name: "Granite", value: 2)
!31 = !DIEnumerator(name: "Andesite", value: 3)
!32 = !DIEnumerator(name: "Diorite", value: 4)
!33 = !DIEnumerator(name: "LapisBlock", value: 5)
!34 = !DIEnumerator(name: "IronBlock", value: 6)
!35 = !DIEnumerator(name: "GoldBlock", value: 7)
!36 = !DIEnumerator(name: "DiamondBlock", value: 8)
!37 = !DIEnumerator(name: "RedstoneBlock", value: 9)
!38 = !{!39, !50, !108}
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !41, isLocal: true, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !43, identifier: "vtable")
!42 = !{}
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "CapacityError<u8>", scope: !44, file: !8, size: 8, align: 8, elements: !46, templateParams: !48, identifier: "e590cc3e5b8fb9bffb72d487e2418497")
!44 = !DINamespace(name: "errors", scope: !45)
!45 = !DINamespace(name: "arrayvec", scope: null)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "element", scope: !43, file: !8, baseType: !11, size: 8, align: 8)
!48 = !{!49}
!49 = !DITemplateTypeParameter(name: "T", type: !11)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !52, isLocal: true, isDefinition: true)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !53, identifier: "vtable")
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "CapacityError<rust_interp::Token>", scope: !44, file: !8, size: 80, align: 8, elements: !54, templateParams: !106, identifier: "7eee8320ca63c2bbece778f8a36ff49")
!54 = !{!55}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "element", scope: !53, file: !8, baseType: !56, size: 80, align: 8)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "Token", scope: !25, file: !8, size: 80, align: 8, elements: !57, identifier: "1067d3d65a8695d1578ab1b5f6e01896")
!57 = !{!58}
!58 = !DICompositeType(tag: DW_TAG_variant_part, scope: !25, file: !8, size: 80, align: 8, elements: !59, templateParams: !42, identifier: "1067d3d65a8695d1578ab1b5f6e01896_variant_part", discriminator: !105)
!59 = !{!60, !62, !64, !66, !68, !70, !72}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "OpenSquare", scope: !58, file: !8, baseType: !61, size: 80, align: 8, extraData: i64 0)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "OpenSquare", scope: !56, file: !8, size: 80, align: 8, elements: !42, templateParams: !42, identifier: "1067d3d65a8695d1578ab1b5f6e01896::OpenSquare")
!62 = !DIDerivedType(tag: DW_TAG_member, name: "CloseSquare", scope: !58, file: !8, baseType: !63, size: 80, align: 8, extraData: i64 1)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "CloseSquare", scope: !56, file: !8, size: 80, align: 8, elements: !42, templateParams: !42, identifier: "1067d3d65a8695d1578ab1b5f6e01896::CloseSquare")
!64 = !DIDerivedType(tag: DW_TAG_member, name: "OpenCurly", scope: !58, file: !8, baseType: !65, size: 80, align: 8, extraData: i64 2)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "OpenCurly", scope: !56, file: !8, size: 80, align: 8, elements: !42, templateParams: !42, identifier: "1067d3d65a8695d1578ab1b5f6e01896::OpenCurly")
!66 = !DIDerivedType(tag: DW_TAG_member, name: "CloseCurly", scope: !58, file: !8, baseType: !67, size: 80, align: 8, extraData: i64 3)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "CloseCurly", scope: !56, file: !8, size: 80, align: 8, elements: !42, templateParams: !42, identifier: "1067d3d65a8695d1578ab1b5f6e01896::CloseCurly")
!68 = !DIDerivedType(tag: DW_TAG_member, name: "OpenParen", scope: !58, file: !8, baseType: !69, size: 80, align: 8, extraData: i64 4)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "OpenParen", scope: !56, file: !8, size: 80, align: 8, elements: !42, templateParams: !42, identifier: "1067d3d65a8695d1578ab1b5f6e01896::OpenParen")
!70 = !DIDerivedType(tag: DW_TAG_member, name: "CloseParen", scope: !58, file: !8, baseType: !71, size: 80, align: 8, extraData: i64 5)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "CloseParen", scope: !56, file: !8, size: 80, align: 8, elements: !42, templateParams: !42, identifier: "1067d3d65a8695d1578ab1b5f6e01896::CloseParen")
!72 = !DIDerivedType(tag: DW_TAG_member, name: "Ident", scope: !58, file: !8, baseType: !73, size: 80, align: 8, extraData: i64 6)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ident", scope: !56, file: !8, size: 80, align: 8, elements: !74, templateParams: !42, identifier: "1067d3d65a8695d1578ab1b5f6e01896::Ident")
!74 = !{!75}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !73, file: !8, baseType: !76, size: 72, align: 8, offset: 8)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ident", scope: !25, file: !8, size: 72, align: 8, elements: !77, templateParams: !42, identifier: "8d7b25d0eb9248ee459177e0be6abf3f")
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !76, file: !8, baseType: !79, size: 72, align: 8)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArrayVec<[u8; 8]>", scope: !45, file: !8, size: 72, align: 8, elements: !80, templateParams: !103, identifier: "a7bc4e76567ce1cf1399d1538c563329")
!80 = !{!81, !102}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "xs", scope: !79, file: !8, baseType: !82, size: 64, align: 8)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "MaybeUninit<[u8; 8]>", scope: !83, file: !8, size: 64, align: 8, elements: !84, templateParams: !100, identifier: "69c550c95b2173117c9d19500f261e9e")
!83 = !DINamespace(name: "maybe_uninit", scope: !45)
!84 = !{!85}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !82, file: !8, baseType: !86, size: 64, align: 8)
!86 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<[u8; 8]>", scope: !87, file: !8, size: 64, align: 8, elements: !89, templateParams: !100, identifier: "a9bbe2de996940576f24da13d2720796")
!87 = !DINamespace(name: "maybe_uninit", scope: !88)
!88 = !DINamespace(name: "mem", scope: !10)
!89 = !{!90, !92}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !86, file: !8, baseType: !91, align: 8)
!91 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !86, file: !8, baseType: !93, size: 64, align: 8)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<[u8; 8]>", scope: !94, file: !8, size: 64, align: 8, elements: !95, templateParams: !100, identifier: "f17494e4e7d22261108993b2c82474c")
!94 = !DINamespace(name: "manually_drop", scope: !88)
!95 = !{!96}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !93, file: !8, baseType: !97, size: 64, align: 8)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 64, align: 8, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 8)
!100 = !{!101}
!101 = !DITemplateTypeParameter(name: "T", type: !97)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !79, file: !8, baseType: !11, size: 8, align: 8, offset: 64)
!103 = !{!104}
!104 = !DITemplateTypeParameter(name: "A", type: !97)
!105 = !DIDerivedType(tag: DW_TAG_member, scope: !25, file: !8, baseType: !11, size: 8, align: 8, flags: DIFlagArtificial)
!106 = !{!107}
!107 = !DITemplateTypeParameter(name: "T", type: !56)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "MC_BLOCKS", linkageName: "_ZN11rust_interp9MC_BLOCKS17h3a4e5990cbc2511fE", scope: !25, file: !110, line: 22, type: !111, isLocal: true, isDefinition: true, align: 4)
!110 = !DIFile(filename: "src/main.rs", directory: "/home/salix/Documents/Minecraft/langcraft/rust_interp", checksumkind: CSK_MD5, checksum: "500cc89242ebc0627c72d1dc78c476be")
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 320, align: 32, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 10)
!114 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !115, producer: "clang LLVM (rustc version 1.46.0-nightly (346aec9b0 2020-07-11))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !42)
!115 = !DIFile(filename: "/home/salix/.cargo/registry/src/github.com-1ecc6299db9ec823/arrayvec-0.5.1/src/lib.rs", directory: "/home/salix/.cargo/registry/src/github.com-1ecc6299db9ec823/arrayvec-0.5.1")
!116 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !117, producer: "clang LLVM (rustc version 1.46.0-nightly (346aec9b0 2020-07-11))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !118, globals: !196)
!117 = !DIFile(filename: "/home/salix/.rustup/toolchains/nightly-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/src/libcore/lib.rs", directory: "/home/salix/.rustup/toolchains/nightly-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/src/libcore")
!118 = !{!7, !15, !119, !126, !131, !140, !146, !152, !157, !164, !169, !176, !185, !187, !192}
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !120, file: !8, baseType: !121, size: 8, align: 8, flags: DIFlagEnumClass, elements: !122)
!120 = !DINamespace(name: "cmp", scope: !10)
!121 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!122 = !{!123, !124, !125}
!123 = !DIEnumerator(name: "Less", value: 4294967295)
!124 = !DIEnumerator(name: "Equal", value: 0)
!125 = !DIEnumerator(name: "Greater", value: 1)
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !127, file: !8, baseType: !11, size: 8, align: 8, flags: DIFlagEnumClass, elements: !128)
!127 = !DINamespace(name: "ffi", scope: !10)
!128 = !{!129, !130}
!129 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!130 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!131 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "EscapeUnicodeState", scope: !132, file: !8, baseType: !11, size: 8, align: 8, flags: DIFlagEnumClass, elements: !133)
!132 = !DINamespace(name: "char", scope: !10)
!133 = !{!134, !135, !136, !137, !138, !139}
!134 = !DIEnumerator(name: "Done", value: 0)
!135 = !DIEnumerator(name: "RightBrace", value: 1)
!136 = !DIEnumerator(name: "Value", value: 2)
!137 = !DIEnumerator(name: "LeftBrace", value: 3)
!138 = !DIEnumerator(name: "Type", value: 4)
!139 = !DIEnumerator(name: "Backslash", value: 5)
!140 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FloatErrorKind", scope: !141, file: !8, baseType: !11, size: 8, align: 8, flags: DIFlagEnumClass, elements: !143)
!141 = !DINamespace(name: "dec2flt", scope: !142)
!142 = !DINamespace(name: "num", scope: !10)
!143 = !{!144, !145}
!144 = !DIEnumerator(name: "Empty", value: 0)
!145 = !DIEnumerator(name: "Invalid", value: 1)
!146 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IntErrorKind", scope: !142, file: !8, baseType: !11, size: 8, align: 8, flags: DIFlagEnumClass, elements: !147)
!147 = !{!144, !148, !149, !150, !151}
!148 = !DIEnumerator(name: "InvalidDigit", value: 1)
!149 = !DIEnumerator(name: "Overflow", value: 2)
!150 = !DIEnumerator(name: "Underflow", value: 3)
!151 = !DIEnumerator(name: "Zero", value: 4)
!152 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CharErrorKind", scope: !153, file: !8, baseType: !11, size: 8, align: 8, flags: DIFlagEnumClass, elements: !154)
!153 = !DINamespace(name: "convert", scope: !132)
!154 = !{!155, !156}
!155 = !DIEnumerator(name: "EmptyString", value: 0)
!156 = !DIEnumerator(name: "TooManyChars", value: 1)
!157 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FpCategory", scope: !142, file: !8, baseType: !11, size: 8, align: 8, flags: DIFlagEnumClass, elements: !158)
!158 = !{!159, !160, !161, !162, !163}
!159 = !DIEnumerator(name: "Nan", value: 0)
!160 = !DIEnumerator(name: "Infinite", value: 1)
!161 = !DIEnumerator(name: "Zero", value: 2)
!162 = !DIEnumerator(name: "Subnormal", value: 3)
!163 = !DIEnumerator(name: "Normal", value: 4)
!164 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sign", scope: !165, file: !8, baseType: !11, size: 8, align: 8, flags: DIFlagEnumClass, elements: !166)
!165 = !DINamespace(name: "parse", scope: !141)
!166 = !{!167, !168}
!167 = !DIEnumerator(name: "Positive", value: 0)
!168 = !DIEnumerator(name: "Negative", value: 1)
!169 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sign", scope: !170, file: !8, baseType: !11, size: 8, align: 8, flags: DIFlagEnumClass, elements: !171)
!170 = !DINamespace(name: "flt2dec", scope: !142)
!171 = !{!172, !173, !174, !175}
!172 = !DIEnumerator(name: "Minus", value: 0)
!173 = !DIEnumerator(name: "MinusRaw", value: 1)
!174 = !DIEnumerator(name: "MinusPlus", value: 2)
!175 = !DIEnumerator(name: "MinusPlusRaw", value: 3)
!176 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !177, file: !8, baseType: !11, size: 8, align: 8, flags: DIFlagEnumClass, elements: !179)
!177 = !DINamespace(name: "atomic", scope: !178)
!178 = !DINamespace(name: "sync", scope: !10)
!179 = !{!180, !181, !182, !183, !184}
!180 = !DIEnumerator(name: "Relaxed", value: 0)
!181 = !DIEnumerator(name: "Release", value: 1)
!182 = !DIEnumerator(name: "Acquire", value: 2)
!183 = !DIEnumerator(name: "AcqRel", value: 3)
!184 = !DIEnumerator(name: "SeqCst", value: 4)
!185 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !18, file: !8, baseType: !11, size: 8, align: 8, flags: DIFlagEnumClass, elements: !186)
!186 = !{!20, !21, !22}
!187 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AllocInit", scope: !188, file: !8, baseType: !11, size: 8, align: 8, flags: DIFlagEnumClass, elements: !189)
!188 = !DINamespace(name: "alloc", scope: !10)
!189 = !{!190, !191}
!190 = !DIEnumerator(name: "Uninitialized", value: 0)
!191 = !DIEnumerator(name: "Zeroed", value: 1)
!192 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReallocPlacement", scope: !188, file: !8, baseType: !11, size: 8, align: 8, flags: DIFlagEnumClass, elements: !193)
!193 = !{!194, !195}
!194 = !DIEnumerator(name: "MayMove", value: 0)
!195 = !DIEnumerator(name: "InPlace", value: 1)
!196 = !{!197, !204, !206, !211, !216, !221, !226, !231, !245, !351, !397, !443, !477, !480, !510, !533, !565, !568, !575, !579, !600, !603, !606, !610, !618, !622, !650, !653, !656, !659, !662, !665, !668, !671, !677, !704, !707, !711, !715, !720, !729, !733, !737, !741, !745, !757, !762, !765, !769, !773, !777, !781, !785, !789, !793, !818, !832, !840, !860, !881, !885, !889, !893, !897, !901, !905, !909, !913, !917, !921, !925, !929, !933, !937, !941, !945, !949, !953, !1025, !1029, !1033, !1042, !1058, !1068, !1072, !1076, !1103, !1122, !1129, !1133, !1137, !1141, !1145, !1154, !1158, !1169, !1202, !1206, !1210, !1225, !1229, !1238, !1241, !1244, !1256, !1263, !1275, !1287, !1299, !1307, !1315, !1324, !1329, !1335, !1340, !1346, !1351, !1357, !1362, !1368, !1373, !1379, !1387, !1390, !1399, !1405, !1410, !1416, !1421, !1426, !1431, !1434, !1439, !1452, !1454, !1474, !1478, !1482, !1486, !1490, !1497, !1501, !1505, !1509, !1514}
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "POW10", linkageName: "_ZN4core3num7flt2dec8strategy6dragon5POW1017hadf2ed6d316cb646E", scope: !199, file: !201, line: 14, type: !202, isLocal: true, isDefinition: true, align: 4)
!199 = !DINamespace(name: "dragon", scope: !200)
!200 = !DINamespace(name: "strategy", scope: !170)
!201 = !DIFile(filename: "/home/salix/.rustup/toolchains/nightly-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/src/libcore/num/flt2dec/strategy/dragon.rs", directory: "/home/salix/.rustup/toolchains/nightly-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/src/libcore", checksumkind: CSK_MD5, checksum: "d6fcfbe9355b94ec95d761c58bb5ab9e")
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 320, align: 32, elements: !112)
!203 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "TWOPOW10", linkageName: "_ZN4core3num7flt2dec8strategy6dragon8TWOPOW1017ha785b952c3339522E", scope: !199, file: !201, line: 16, type: !202, isLocal: true, isDefinition: true, align: 4)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "POW10TO16", linkageName: "_ZN4core3num7flt2dec8strategy6dragon9POW10TO1617h6ea33ac35555604cE", scope: !199, file: !201, line: 20, type: !208, isLocal: true, isDefinition: true, align: 4)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 64, align: 32, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 2)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "POW10TO32", linkageName: "_ZN4core3num7flt2dec8strategy6dragon9POW10TO3217hb36b320cecddac90E", scope: !199, file: !201, line: 21, type: !213, isLocal: true, isDefinition: true, align: 4)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 128, align: 32, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 4)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "POW10TO64", linkageName: "_ZN4core3num7flt2dec8strategy6dragon9POW10TO6417h36516299da694a69E", scope: !199, file: !201, line: 22, type: !218, isLocal: true, isDefinition: true, align: 4)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 224, align: 32, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 7)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "POW10TO128", linkageName: "_ZN4core3num7flt2dec8strategy6dragon10POW10TO12817habc910585547488eE", scope: !199, file: !201, line: 23, type: !223, isLocal: true, isDefinition: true, align: 4)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 448, align: 32, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 14)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "POW10TO256", linkageName: "_ZN4core3num7flt2dec8strategy6dragon10POW10TO25617h32396d42eb5d84e5E", scope: !199, file: !201, line: 27, type: !228, isLocal: true, isDefinition: true, align: 4)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 864, align: 32, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 27)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "CACHED_POW10", linkageName: "_ZN4core3num7flt2dec8strategy5grisu12CACHED_POW1017h19f93e56e809610dE", scope: !233, file: !234, line: 28, type: !235, isLocal: false, isDefinition: true, align: 4)
!233 = !DINamespace(name: "grisu", scope: !200)
!234 = !DIFile(filename: "/home/salix/.rustup/toolchains/nightly-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/src/libcore/num/flt2dec/strategy/grisu.rs", directory: "/home/salix/.rustup/toolchains/nightly-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/src/libcore", checksumkind: CSK_MD5, checksum: "4f495284573f448d3ca491cb3b81e45d")
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 7776, align: 32, elements: !243)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u64, i16, i16)", file: !8, size: 96, align: 32, elements: !237, templateParams: !42, identifier: "8829cb0cc2e8f23031a37cefb43d84a1")
!237 = !{!238, !240, !242}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !236, file: !8, baseType: !239, size: 64, align: 32)
!239 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !236, file: !8, baseType: !241, size: 16, align: 16, offset: 64)
!241 = !DIBasicType(name: "i16", size: 16, encoding: DW_ATE_signed)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !236, file: !8, baseType: !241, size: 16, align: 16, offset: 80)
!243 = !{!244}
!244 = !DISubrange(count: 81)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !247, isLocal: true, isDefinition: true)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !248, identifier: "vtable")
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "FlattenCompat<core::iter::adapters::Map<core::str::Chars, core::str::CharEscapeDebugContinue>, core::char::EscapeDebug>", scope: !249, file: !8, size: 320, align: 32, elements: !252, templateParams: !349, identifier: "9a38d0dce28b58b44f590f9b67c07759")
!249 = !DINamespace(name: "flatten", scope: !250)
!250 = !DINamespace(name: "adapters", scope: !251)
!251 = !DINamespace(name: "iter", scope: !10)
!252 = !{!253, !303, !348}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !248, file: !8, baseType: !254, size: 64, align: 32)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fuse<core::iter::adapters::Map<core::str::Chars, core::str::CharEscapeDebugContinue>>", scope: !255, file: !8, size: 64, align: 32, elements: !256, templateParams: !301, identifier: "98ac87923d45eac787935f9eafeca18c")
!255 = !DINamespace(name: "fuse", scope: !250)
!256 = !{!257}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !254, file: !8, baseType: !258, size: 64, align: 32)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::iter::adapters::Map<core::str::Chars, core::str::CharEscapeDebugContinue>>", scope: !259, file: !8, size: 64, align: 32, elements: !260, identifier: "dba97e132b559bee6c6eeae118e45179")
!259 = !DINamespace(name: "option", scope: !10)
!260 = !{!261}
!261 = !DICompositeType(tag: DW_TAG_variant_part, scope: !259, file: !8, size: 64, align: 32, elements: !262, templateParams: !265, identifier: "dba97e132b559bee6c6eeae118e45179_variant_part", discriminator: !300)
!262 = !{!263, !296}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !261, file: !8, baseType: !264, size: 64, align: 32, extraData: i64 0)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !258, file: !8, size: 64, align: 32, elements: !42, templateParams: !265, identifier: "dba97e132b559bee6c6eeae118e45179::None")
!265 = !{!266}
!266 = !DITemplateTypeParameter(name: "T", type: !267)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::str::Chars, core::str::CharEscapeDebugContinue>", scope: !250, file: !8, size: 64, align: 32, elements: !268, templateParams: !293, identifier: "c006df3a3db97e4f18ab66ecb1fcf30a")
!268 = !{!269, !291}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !267, file: !8, baseType: !270, size: 64, align: 32)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "Chars", scope: !271, file: !8, size: 64, align: 32, elements: !272, templateParams: !42, identifier: "8b23cd9a152c77f64cb5a15a8f1c2b3")
!271 = !DINamespace(name: "str", scope: !10)
!272 = !{!273}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !270, file: !8, baseType: !274, size: 64, align: 32)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u8>", scope: !275, file: !8, size: 64, align: 32, elements: !276, templateParams: !48, identifier: "2ab65ecb3a68d5c16fb6c576824a3a04")
!275 = !DINamespace(name: "slice", scope: !10)
!276 = !{!277, !284, !285}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !274, file: !8, baseType: !278, size: 32, align: 32)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !279, file: !8, size: 32, align: 32, elements: !281, templateParams: !48, identifier: "9faf3d8204ad43fabcad54a2e0f53d01")
!279 = !DINamespace(name: "non_null", scope: !280)
!280 = !DINamespace(name: "ptr", scope: !10)
!281 = !{!282}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !278, file: !8, baseType: !283, size: 32, align: 32)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !11, size: 32, align: 32, dwarfAddressSpace: 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !274, file: !8, baseType: !283, size: 32, align: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !274, file: !8, baseType: !286, align: 8)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u8>", scope: !287, file: !8, align: 8, elements: !42, templateParams: !288, identifier: "de5b6906abefff3ab2e8ba1c7aadea1b")
!287 = !DINamespace(name: "marker", scope: !10)
!288 = !{!289}
!289 = !DITemplateTypeParameter(name: "T", type: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !11, size: 32, align: 32, dwarfAddressSpace: 0)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !267, file: !8, baseType: !292, align: 8)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "CharEscapeDebugContinue", scope: !271, file: !8, align: 8, elements: !42, templateParams: !42, identifier: "841576a616cb37027220df45559728d4")
!293 = !{!294, !295}
!294 = !DITemplateTypeParameter(name: "I", type: !270)
!295 = !DITemplateTypeParameter(name: "F", type: !292)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !261, file: !8, baseType: !297, size: 64, align: 32)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !258, file: !8, size: 64, align: 32, elements: !298, templateParams: !265, identifier: "dba97e132b559bee6c6eeae118e45179::Some")
!298 = !{!299}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !297, file: !8, baseType: !267, size: 64, align: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, scope: !259, file: !8, baseType: !203, size: 32, align: 32, flags: DIFlagArtificial)
!301 = !{!302}
!302 = !DITemplateTypeParameter(name: "I", type: !267)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "frontiter", scope: !248, file: !8, baseType: !304, size: 128, align: 32, offset: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::char::EscapeDebug>", scope: !259, file: !8, size: 128, align: 32, elements: !305, identifier: "67db62f100d89f874af0dff04548a131")
!305 = !{!306}
!306 = !DICompositeType(tag: DW_TAG_variant_part, scope: !259, file: !8, size: 128, align: 32, elements: !307, templateParams: !310, identifier: "67db62f100d89f874af0dff04548a131_variant_part", discriminator: !300)
!307 = !{!308, !344}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !306, file: !8, baseType: !309, size: 128, align: 32, extraData: i64 4)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !304, file: !8, size: 128, align: 32, elements: !42, templateParams: !310, identifier: "67db62f100d89f874af0dff04548a131::None")
!310 = !{!311}
!311 = !DITemplateTypeParameter(name: "T", type: !312)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "EscapeDebug", scope: !132, file: !8, size: 128, align: 32, elements: !313, templateParams: !42, identifier: "9f456e3fd08b557151e78c786a37a210")
!313 = !{!314}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !312, file: !8, baseType: !315, size: 128, align: 32)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "EscapeDefault", scope: !132, file: !8, size: 128, align: 32, elements: !316, templateParams: !42, identifier: "97444dd268673a3352eb380f2864f178")
!316 = !{!317}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !315, file: !8, baseType: !318, size: 128, align: 32)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "EscapeDefaultState", scope: !132, file: !8, size: 128, align: 32, elements: !319, identifier: "26803d372dba8b422638e1df11cc5469")
!319 = !{!320}
!320 = !DICompositeType(tag: DW_TAG_variant_part, scope: !132, file: !8, size: 128, align: 32, elements: !321, templateParams: !42, identifier: "26803d372dba8b422638e1df11cc5469_variant_part", discriminator: !343)
!321 = !{!322, !324, !329, !333}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Done", scope: !320, file: !8, baseType: !323, size: 128, align: 32, extraData: i64 0)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "Done", scope: !318, file: !8, size: 128, align: 32, elements: !42, templateParams: !42, identifier: "26803d372dba8b422638e1df11cc5469::Done")
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Char", scope: !320, file: !8, baseType: !325, size: 128, align: 32, extraData: i64 1)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "Char", scope: !318, file: !8, size: 128, align: 32, elements: !326, templateParams: !42, identifier: "26803d372dba8b422638e1df11cc5469::Char")
!326 = !{!327}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !325, file: !8, baseType: !328, size: 32, align: 32, offset: 32)
!328 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_unsigned_char)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Backslash", scope: !320, file: !8, baseType: !330, size: 128, align: 32, extraData: i64 2)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backslash", scope: !318, file: !8, size: 128, align: 32, elements: !331, templateParams: !42, identifier: "26803d372dba8b422638e1df11cc5469::Backslash")
!331 = !{!332}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !330, file: !8, baseType: !328, size: 32, align: 32, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Unicode", scope: !320, file: !8, baseType: !334, size: 128, align: 32, extraData: i64 3)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unicode", scope: !318, file: !8, size: 128, align: 32, elements: !335, templateParams: !42, identifier: "26803d372dba8b422638e1df11cc5469::Unicode")
!335 = !{!336}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !334, file: !8, baseType: !337, size: 96, align: 32, offset: 32)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "EscapeUnicode", scope: !132, file: !8, size: 96, align: 32, elements: !338, templateParams: !42, identifier: "b7934f3640adfae164804febcdbce6cb")
!338 = !{!339, !340, !341}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !337, file: !8, baseType: !328, size: 32, align: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !337, file: !8, baseType: !131, size: 8, align: 8, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "hex_digit_idx", scope: !337, file: !8, baseType: !342, size: 32, align: 32, offset: 32)
!342 = !DIBasicType(name: "usize", size: 32, encoding: DW_ATE_unsigned)
!343 = !DIDerivedType(tag: DW_TAG_member, scope: !132, file: !8, baseType: !203, size: 32, align: 32, flags: DIFlagArtificial)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !306, file: !8, baseType: !345, size: 128, align: 32)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !304, file: !8, size: 128, align: 32, elements: !346, templateParams: !310, identifier: "67db62f100d89f874af0dff04548a131::Some")
!346 = !{!347}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !345, file: !8, baseType: !312, size: 128, align: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "backiter", scope: !248, file: !8, baseType: !304, size: 128, align: 32, offset: 192)
!349 = !{!302, !350}
!350 = !DITemplateTypeParameter(name: "U", type: !312)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !354, identifier: "vtable")
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "FlattenCompat<core::iter::adapters::Map<core::str::Chars, core::str::CharEscapeDefault>, core::char::EscapeDefault>", scope: !249, file: !8, size: 320, align: 32, elements: !355, templateParams: !395, identifier: "db8f737f4a73f340e6f0eea6eb57f192")
!355 = !{!356, !381, !394}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !354, file: !8, baseType: !357, size: 64, align: 32)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fuse<core::iter::adapters::Map<core::str::Chars, core::str::CharEscapeDefault>>", scope: !255, file: !8, size: 64, align: 32, elements: !358, templateParams: !379, identifier: "d654a9455db0cb07914a050ca77b4b53")
!358 = !{!359}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !357, file: !8, baseType: !360, size: 64, align: 32)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::iter::adapters::Map<core::str::Chars, core::str::CharEscapeDefault>>", scope: !259, file: !8, size: 64, align: 32, elements: !361, identifier: "42142de59d2a7ee813d7954e574155b0")
!361 = !{!362}
!362 = !DICompositeType(tag: DW_TAG_variant_part, scope: !259, file: !8, size: 64, align: 32, elements: !363, templateParams: !366, identifier: "42142de59d2a7ee813d7954e574155b0_variant_part", discriminator: !300)
!363 = !{!364, !375}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !362, file: !8, baseType: !365, size: 64, align: 32, extraData: i64 0)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !360, file: !8, size: 64, align: 32, elements: !42, templateParams: !366, identifier: "42142de59d2a7ee813d7954e574155b0::None")
!366 = !{!367}
!367 = !DITemplateTypeParameter(name: "T", type: !368)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::str::Chars, core::str::CharEscapeDefault>", scope: !250, file: !8, size: 64, align: 32, elements: !369, templateParams: !373, identifier: "72cfc1108aa7077fbb3b60fe036d4662")
!369 = !{!370, !371}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !368, file: !8, baseType: !270, size: 64, align: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !368, file: !8, baseType: !372, align: 8)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "CharEscapeDefault", scope: !271, file: !8, align: 8, elements: !42, templateParams: !42, identifier: "4f73b75aea85b4e0e7120f3f52fc5d48")
!373 = !{!294, !374}
!374 = !DITemplateTypeParameter(name: "F", type: !372)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !362, file: !8, baseType: !376, size: 64, align: 32)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !360, file: !8, size: 64, align: 32, elements: !377, templateParams: !366, identifier: "42142de59d2a7ee813d7954e574155b0::Some")
!377 = !{!378}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !376, file: !8, baseType: !368, size: 64, align: 32)
!379 = !{!380}
!380 = !DITemplateTypeParameter(name: "I", type: !368)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "frontiter", scope: !354, file: !8, baseType: !382, size: 128, align: 32, offset: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::char::EscapeDefault>", scope: !259, file: !8, size: 128, align: 32, elements: !383, identifier: "a1fda88724f9bde84d48aa554ba30a")
!383 = !{!384}
!384 = !DICompositeType(tag: DW_TAG_variant_part, scope: !259, file: !8, size: 128, align: 32, elements: !385, templateParams: !388, identifier: "a1fda88724f9bde84d48aa554ba30a_variant_part", discriminator: !300)
!385 = !{!386, !390}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !384, file: !8, baseType: !387, size: 128, align: 32, extraData: i64 4)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !382, file: !8, size: 128, align: 32, elements: !42, templateParams: !388, identifier: "a1fda88724f9bde84d48aa554ba30a::None")
!388 = !{!389}
!389 = !DITemplateTypeParameter(name: "T", type: !315)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !384, file: !8, baseType: !391, size: 128, align: 32)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !382, file: !8, size: 128, align: 32, elements: !392, templateParams: !388, identifier: "a1fda88724f9bde84d48aa554ba30a::Some")
!392 = !{!393}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !391, file: !8, baseType: !315, size: 128, align: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "backiter", scope: !354, file: !8, baseType: !382, size: 128, align: 32, offset: 192)
!395 = !{!380, !396}
!396 = !DITemplateTypeParameter(name: "U", type: !315)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !399, isLocal: true, isDefinition: true)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !400, identifier: "vtable")
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "FlattenCompat<core::iter::adapters::Map<core::str::Chars, core::str::CharEscapeUnicode>, core::char::EscapeUnicode>", scope: !249, file: !8, size: 256, align: 32, elements: !401, templateParams: !441, identifier: "1c380dad8bbd06bb0b4a72f30e6d9dd")
!401 = !{!402, !427, !440}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !400, file: !8, baseType: !403, size: 64, align: 32)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fuse<core::iter::adapters::Map<core::str::Chars, core::str::CharEscapeUnicode>>", scope: !255, file: !8, size: 64, align: 32, elements: !404, templateParams: !425, identifier: "7627418416ba32deab69e31fe39b0cac")
!404 = !{!405}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !403, file: !8, baseType: !406, size: 64, align: 32)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::iter::adapters::Map<core::str::Chars, core::str::CharEscapeUnicode>>", scope: !259, file: !8, size: 64, align: 32, elements: !407, identifier: "b04aa1acaeafd05da6ee7dc33e9dce28")
!407 = !{!408}
!408 = !DICompositeType(tag: DW_TAG_variant_part, scope: !259, file: !8, size: 64, align: 32, elements: !409, templateParams: !412, identifier: "b04aa1acaeafd05da6ee7dc33e9dce28_variant_part", discriminator: !300)
!409 = !{!410, !421}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !408, file: !8, baseType: !411, size: 64, align: 32, extraData: i64 0)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !406, file: !8, size: 64, align: 32, elements: !42, templateParams: !412, identifier: "b04aa1acaeafd05da6ee7dc33e9dce28::None")
!412 = !{!413}
!413 = !DITemplateTypeParameter(name: "T", type: !414)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::str::Chars, core::str::CharEscapeUnicode>", scope: !250, file: !8, size: 64, align: 32, elements: !415, templateParams: !419, identifier: "d7a66388219441c5d555b00bf1b848b9")
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !414, file: !8, baseType: !270, size: 64, align: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !414, file: !8, baseType: !418, align: 8)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "CharEscapeUnicode", scope: !271, file: !8, align: 8, elements: !42, templateParams: !42, identifier: "66f08f438900ecd0f2e40040c923c391")
!419 = !{!294, !420}
!420 = !DITemplateTypeParameter(name: "F", type: !418)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !408, file: !8, baseType: !422, size: 64, align: 32)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !406, file: !8, size: 64, align: 32, elements: !423, templateParams: !412, identifier: "b04aa1acaeafd05da6ee7dc33e9dce28::Some")
!423 = !{!424}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !422, file: !8, baseType: !414, size: 64, align: 32)
!425 = !{!426}
!426 = !DITemplateTypeParameter(name: "I", type: !414)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "frontiter", scope: !400, file: !8, baseType: !428, size: 96, align: 32, offset: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::char::EscapeUnicode>", scope: !259, file: !8, size: 96, align: 32, elements: !429, identifier: "6142273c0ff462ef9256f4cd39a984")
!429 = !{!430}
!430 = !DICompositeType(tag: DW_TAG_variant_part, scope: !259, file: !8, size: 96, align: 32, elements: !431, templateParams: !434, identifier: "6142273c0ff462ef9256f4cd39a984_variant_part", discriminator: !300)
!431 = !{!432, !436}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !430, file: !8, baseType: !433, size: 96, align: 32, extraData: i64 1114112)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !428, file: !8, size: 96, align: 32, elements: !42, templateParams: !434, identifier: "6142273c0ff462ef9256f4cd39a984::None")
!434 = !{!435}
!435 = !DITemplateTypeParameter(name: "T", type: !337)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !430, file: !8, baseType: !437, size: 96, align: 32)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !428, file: !8, size: 96, align: 32, elements: !438, templateParams: !434, identifier: "6142273c0ff462ef9256f4cd39a984::Some")
!438 = !{!439}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !437, file: !8, baseType: !337, size: 96, align: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "backiter", scope: !400, file: !8, baseType: !428, size: 96, align: 32, offset: 160)
!441 = !{!426, !442}
!442 = !DITemplateTypeParameter(name: "U", type: !337)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !445, isLocal: true, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !446, identifier: "vtable")
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "FlattenCompat<core::option::IntoIter<core::char::EscapeDebug>, core::char::EscapeDebug>", scope: !249, file: !8, size: 384, align: 32, elements: !447, templateParams: !476, identifier: "8a171b89ad1e31a4994666948104d059")
!447 = !{!448, !474, !475}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !446, file: !8, baseType: !449, size: 128, align: 32)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fuse<core::option::IntoIter<core::char::EscapeDebug>>", scope: !255, file: !8, size: 128, align: 32, elements: !450, templateParams: !472, identifier: "f559bfee30effc95d5a9b1c85757e40")
!450 = !{!451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !449, file: !8, baseType: !452, size: 128, align: 32)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::option::IntoIter<core::char::EscapeDebug>>", scope: !259, file: !8, size: 128, align: 32, elements: !453, identifier: "ee643985c31889853a0dfa745751cf24")
!453 = !{!454}
!454 = !DICompositeType(tag: DW_TAG_variant_part, scope: !259, file: !8, size: 128, align: 32, elements: !455, templateParams: !458, identifier: "ee643985c31889853a0dfa745751cf24_variant_part", discriminator: !300)
!455 = !{!456, !468}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !454, file: !8, baseType: !457, size: 128, align: 32, extraData: i64 5)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !452, file: !8, size: 128, align: 32, elements: !42, templateParams: !458, identifier: "ee643985c31889853a0dfa745751cf24::None")
!458 = !{!459}
!459 = !DITemplateTypeParameter(name: "T", type: !460)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "IntoIter<core::char::EscapeDebug>", scope: !259, file: !8, size: 128, align: 32, elements: !461, templateParams: !466, identifier: "ac27daba33f7ffbc8648a1600bae556")
!461 = !{!462}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !460, file: !8, baseType: !463, size: 128, align: 32)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "Item<core::char::EscapeDebug>", scope: !259, file: !8, size: 128, align: 32, elements: !464, templateParams: !466, identifier: "edea35c6f60691274a820f0b08c7751a")
!464 = !{!465}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !463, file: !8, baseType: !304, size: 128, align: 32)
!466 = !{!467}
!467 = !DITemplateTypeParameter(name: "A", type: !312)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !454, file: !8, baseType: !469, size: 128, align: 32)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !452, file: !8, size: 128, align: 32, elements: !470, templateParams: !458, identifier: "ee643985c31889853a0dfa745751cf24::Some")
!470 = !{!471}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !469, file: !8, baseType: !460, size: 128, align: 32)
!472 = !{!473}
!473 = !DITemplateTypeParameter(name: "I", type: !460)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "frontiter", scope: !446, file: !8, baseType: !304, size: 128, align: 32, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "backiter", scope: !446, file: !8, baseType: !304, size: 128, align: 32, offset: 256)
!476 = !{!473, !350}
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !479, isLocal: true, isDefinition: true)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !270, identifier: "vtable")
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !482, isLocal: true, isDefinition: true)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !483, identifier: "vtable")
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "SplitTerminator<char>", scope: !271, file: !8, size: 320, align: 32, elements: !484, templateParams: !508, identifier: "f95e2c6b847d69841bc2da02cd7477f")
!484 = !{!485}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !483, file: !8, baseType: !486, size: 320, align: 32)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "SplitInternal<char>", scope: !271, file: !8, size: 320, align: 32, elements: !487, templateParams: !508, identifier: "153d741394f16aecb0b86c6162eb7623")
!487 = !{!488, !489, !490, !505, !507}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !486, file: !8, baseType: !342, size: 32, align: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !486, file: !8, baseType: !342, size: 32, align: 32, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "matcher", scope: !486, file: !8, baseType: !491, size: 224, align: 32, offset: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "CharSearcher", scope: !492, file: !8, size: 224, align: 32, elements: !493, templateParams: !42, identifier: "7184312f3c84304c1e02c6132fdbbf33")
!492 = !DINamespace(name: "pattern", scope: !271)
!493 = !{!494, !499, !500, !501, !502, !503}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "haystack", scope: !491, file: !8, baseType: !495, size: 64, align: 32)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !8, size: 64, align: 32, elements: !496, templateParams: !42, identifier: "7ef2a91eecc7bcf4b4aaea2dbce79437")
!496 = !{!497, !498}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !495, file: !8, baseType: !283, size: 32, align: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !495, file: !8, baseType: !342, size: 32, align: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "finger", scope: !491, file: !8, baseType: !342, size: 32, align: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "finger_back", scope: !491, file: !8, baseType: !342, size: 32, align: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "needle", scope: !491, file: !8, baseType: !328, size: 32, align: 32, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_size", scope: !491, file: !8, baseType: !342, size: 32, align: 32, offset: 160)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_encoded", scope: !491, file: !8, baseType: !504, size: 32, align: 8, offset: 192)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 32, align: 8, elements: !214)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "allow_trailing_empty", scope: !486, file: !8, baseType: !506, size: 8, align: 8, offset: 288)
!506 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "finished", scope: !486, file: !8, baseType: !506, size: 8, align: 8, offset: 296)
!508 = !{!509}
!509 = !DITemplateTypeParameter(name: "P", type: !328)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !512, isLocal: true, isDefinition: true)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !513, identifier: "vtable")
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "Filter<core::slice::Split<u8, core::str::IsAsciiWhitespace>, core::str::BytesIsNotEmpty>", scope: !250, file: !8, size: 96, align: 32, elements: !514, templateParams: !530, identifier: "962cb73f71ee3d4d5023f43e48174b6c")
!514 = !{!515, !528}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !513, file: !8, baseType: !516, size: 96, align: 32)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "Split<u8, core::str::IsAsciiWhitespace>", scope: !275, file: !8, size: 96, align: 32, elements: !517, templateParams: !526, identifier: "de3c1183c8feb9a9cce3ddd9f4fb21db")
!517 = !{!518, !523, !525}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !516, file: !8, baseType: !519, size: 64, align: 32)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !8, size: 64, align: 32, elements: !520, templateParams: !42, identifier: "585202bcfc7dfd1dd72e8befe2491ee4")
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !519, file: !8, baseType: !283, size: 32, align: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !519, file: !8, baseType: !342, size: 32, align: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !516, file: !8, baseType: !524, align: 8)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "IsAsciiWhitespace", scope: !271, file: !8, align: 8, elements: !42, templateParams: !42, identifier: "68e96966736c86c5840f398b104330ec")
!525 = !DIDerivedType(tag: DW_TAG_member, name: "finished", scope: !516, file: !8, baseType: !506, size: 8, align: 8, offset: 64)
!526 = !{!49, !527}
!527 = !DITemplateTypeParameter(name: "P", type: !524)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !513, file: !8, baseType: !529, align: 8)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "BytesIsNotEmpty", scope: !271, file: !8, align: 8, elements: !42, templateParams: !42, identifier: "1829e270d3788c1241b7991b0cac0f54")
!530 = !{!531, !532}
!531 = !DITemplateTypeParameter(name: "I", type: !516)
!532 = !DITemplateTypeParameter(name: "P", type: !529)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !535, isLocal: true, isDefinition: true)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !536, identifier: "vtable")
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "Split<core::str::IsWhitespace>", scope: !271, file: !8, size: 256, align: 32, elements: !537, templateParams: !563, identifier: "167a1b535c6689d4613b2b8cc9c41a1f")
!537 = !{!538}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !536, file: !8, baseType: !539, size: 256, align: 32)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "SplitInternal<core::str::IsWhitespace>", scope: !271, file: !8, size: 256, align: 32, elements: !540, templateParams: !563, identifier: "7c598e6601097fe2709b496d37e7c010")
!540 = !{!541, !542, !543, !561, !562}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !539, file: !8, baseType: !342, size: 32, align: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !539, file: !8, baseType: !342, size: 32, align: 32, offset: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "matcher", scope: !539, file: !8, baseType: !544, size: 160, align: 32, offset: 64)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "CharPredicateSearcher<core::str::IsWhitespace>", scope: !492, file: !8, size: 160, align: 32, elements: !545, templateParams: !559, identifier: "755c54f052c95739472ad5c6c25b2b4f")
!545 = !{!546}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !544, file: !8, baseType: !547, size: 160, align: 32)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiCharEqSearcher<core::str::IsWhitespace>", scope: !492, file: !8, size: 160, align: 32, elements: !548, templateParams: !557, identifier: "9ef7dde136087ca71355ad0a4a5a3aef")
!548 = !{!549, !551, !552}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "char_eq", scope: !547, file: !8, baseType: !550, align: 8)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "IsWhitespace", scope: !271, file: !8, align: 8, elements: !42, templateParams: !42, identifier: "1824ed181a454d58e1f6a905b43634c4")
!551 = !DIDerivedType(tag: DW_TAG_member, name: "haystack", scope: !547, file: !8, baseType: !495, size: 64, align: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "char_indices", scope: !547, file: !8, baseType: !553, size: 96, align: 32, offset: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "CharIndices", scope: !271, file: !8, size: 96, align: 32, elements: !554, templateParams: !42, identifier: "5e9ae748b0063ec237608a69f70c82fa")
!554 = !{!555, !556}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "front_offset", scope: !553, file: !8, baseType: !342, size: 32, align: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !553, file: !8, baseType: !270, size: 64, align: 32, offset: 32)
!557 = !{!558}
!558 = !DITemplateTypeParameter(name: "C", type: !550)
!559 = !{!560}
!560 = !DITemplateTypeParameter(name: "F", type: !550)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "allow_trailing_empty", scope: !539, file: !8, baseType: !506, size: 8, align: 8, offset: 224)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "finished", scope: !539, file: !8, baseType: !506, size: 8, align: 8, offset: 232)
!563 = !{!564}
!564 = !DITemplateTypeParameter(name: "P", type: !550)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !567, isLocal: true, isDefinition: true)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !516, identifier: "vtable")
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !570, isLocal: true, isDefinition: true)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !571, identifier: "vtable")
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoPayload", scope: !572, file: !8, align: 8, elements: !42, templateParams: !42, identifier: "15b46ce473c8a90b2a2ca269fbd5c4f8")
!572 = !DINamespace(name: "internal_constructor", scope: !573)
!573 = !DINamespace(name: "{{impl}}", scope: !574)
!574 = !DINamespace(name: "panic", scope: !10)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !577, isLocal: true, isDefinition: true)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !578, identifier: "vtable")
!578 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !582, identifier: "vtable")
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "PadAdapter", scope: !583, file: !8, size: 96, align: 32, elements: !584, templateParams: !42, identifier: "9b27d7691438840869b91407cc2afc8c")
!583 = !DINamespace(name: "builders", scope: !18)
!584 = !{!585, !595}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !582, file: !8, baseType: !586, size: 64, align: 32)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut Write", scope: !18, file: !8, size: 64, align: 32, elements: !587, templateParams: !42, identifier: "f1355f40e05e6b01622ba16e4f52bab5")
!587 = !{!588, !590}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !586, file: !8, baseType: !589, size: 32, align: 32, flags: DIFlagArtificial)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !11, size: 32, align: 32, dwarfAddressSpace: 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !586, file: !8, baseType: !591, size: 32, align: 32, offset: 32, flags: DIFlagArtificial)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !592, size: 32, align: 32, dwarfAddressSpace: 0)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 96, align: 32, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 3)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !582, file: !8, baseType: !596, size: 32, align: 32, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::PadAdapterState", baseType: !597, size: 32, align: 32, dwarfAddressSpace: 0)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "PadAdapterState", scope: !583, file: !8, size: 8, align: 8, elements: !598, templateParams: !42, identifier: "33437466c569da4169ea0fc4414bc398")
!598 = !{!599}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "on_newline", scope: !597, file: !8, baseType: !506, size: 8, align: 8)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !602, isLocal: true, isDefinition: true)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !290, identifier: "vtable")
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !605, isLocal: true, isDefinition: true)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !328, identifier: "vtable")
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !608, isLocal: true, isDefinition: true)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !609, identifier: "vtable")
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&char", baseType: !328, size: 32, align: 32, dwarfAddressSpace: 0)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "DEC_DIGITS_LUT", linkageName: "_ZN4core3fmt3num14DEC_DIGITS_LUT17hbbb8e583ec0e69b5E", scope: !612, file: !613, line: 183, type: !614, isLocal: true, isDefinition: true, align: 4)
!612 = !DINamespace(name: "num", scope: !18)
!613 = !DIFile(filename: "/home/salix/.rustup/toolchains/nightly-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/src/libcore/fmt/num.rs", directory: "/home/salix/.rustup/toolchains/nightly-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/src/libcore", checksumkind: CSK_MD5, checksum: "61392c5da2cbc772261228616b04ba1d")
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[u8; 200]", baseType: !615, size: 32, align: 32, dwarfAddressSpace: 0)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 1600, align: 8, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 200)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !620, isLocal: true, isDefinition: true)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !621, identifier: "vtable")
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::PadAdapter", baseType: !582, size: 32, align: 32, dwarfAddressSpace: 0)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "USIZE_MARKER", linkageName: "_ZN4core3fmt12USIZE_MARKER17ha016cb164ba0e39aE", scope: !18, file: !624, line: 272, type: !625, isLocal: false, isDefinition: true, align: 4)
!624 = !DIFile(filename: "/home/salix/.rustup/toolchains/nightly-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/src/libcore/fmt/mod.rs", directory: "/home/salix/.rustup/toolchains/nightly-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/src/libcore", checksumkind: CSK_MD5, checksum: "d51e9a53dcfda96bc5d8d2f208c290b9")
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&usize, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !626, size: 32, align: 32, dwarfAddressSpace: 0)
!626 = !DISubroutineType(types: !627)
!627 = !{!7, !628, !629}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !342, size: 32, align: 32, dwarfAddressSpace: 0)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !630, size: 32, align: 32, dwarfAddressSpace: 0)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !18, file: !8, size: 288, align: 32, elements: !631, templateParams: !42, identifier: "226cb281f19e88c89df841f5415bae64")
!631 = !{!632, !633, !634, !635, !648, !649}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !630, file: !8, baseType: !203, size: 32, align: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !630, file: !8, baseType: !328, size: 32, align: 32, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !630, file: !8, baseType: !15, size: 8, align: 8, offset: 256)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !630, file: !8, baseType: !636, size: 64, align: 32, offset: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !259, file: !8, size: 64, align: 32, elements: !637, identifier: "ad9d0003c0be781f2eae3b580ff829ed")
!637 = !{!638}
!638 = !DICompositeType(tag: DW_TAG_variant_part, scope: !259, file: !8, size: 64, align: 32, elements: !639, templateParams: !642, identifier: "ad9d0003c0be781f2eae3b580ff829ed_variant_part", discriminator: !300)
!639 = !{!640, !644}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !638, file: !8, baseType: !641, size: 64, align: 32, extraData: i64 0)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !636, file: !8, size: 64, align: 32, elements: !42, templateParams: !642, identifier: "ad9d0003c0be781f2eae3b580ff829ed::None")
!642 = !{!643}
!643 = !DITemplateTypeParameter(name: "T", type: !342)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !638, file: !8, baseType: !645, size: 64, align: 32, extraData: i64 1)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !636, file: !8, size: 64, align: 32, elements: !646, templateParams: !642, identifier: "ad9d0003c0be781f2eae3b580ff829ed::Some")
!646 = !{!647}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !645, file: !8, baseType: !342, size: 32, align: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !630, file: !8, baseType: !636, size: 64, align: 32, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !630, file: !8, baseType: !586, size: 64, align: 32, offset: 192)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !652, isLocal: true, isDefinition: true)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !519, identifier: "vtable")
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !655, isLocal: true, isDefinition: true)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !506, identifier: "vtable")
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !658, isLocal: true, isDefinition: true)
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !495, identifier: "vtable")
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !661, isLocal: true, isDefinition: true)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !553, identifier: "vtable")
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !664, isLocal: true, isDefinition: true)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !342, identifier: "vtable")
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !667, isLocal: true, isDefinition: true)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !544, identifier: "vtable")
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !670, isLocal: true, isDefinition: true)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !491, identifier: "vtable")
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "UTF8_CHAR_WIDTH", linkageName: "_ZN4core3str15UTF8_CHAR_WIDTH17h3504430ab9f01676E", scope: !271, file: !673, line: 1696, type: !674, isLocal: false, isDefinition: true, align: 1)
!673 = !DIFile(filename: "/home/salix/.rustup/toolchains/nightly-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/src/libcore/str/mod.rs", directory: "/home/salix/.rustup/toolchains/nightly-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/src/libcore", checksumkind: CSK_MD5, checksum: "5ae7a65340faf8f70c10abe9fd75f0d5")
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 2048, align: 8, elements: !675)
!675 = !{!676}
!676 = !DISubrange(count: 256)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !679, isLocal: true, isDefinition: true)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !680, identifier: "vtable")
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::task::wake::Waker", baseType: !681, size: 32, align: 32, dwarfAddressSpace: 0)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "Waker", scope: !682, file: !8, size: 64, align: 32, elements: !684, templateParams: !42, identifier: "8c996dfe90a67b2fb1b9fe9945479560")
!682 = !DINamespace(name: "wake", scope: !683)
!683 = !DINamespace(name: "task", scope: !10)
!684 = !{!685}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "waker", scope: !681, file: !8, baseType: !686, size: 64, align: 32)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawWaker", scope: !682, file: !8, size: 64, align: 32, elements: !687, templateParams: !42, identifier: "b328ca6621ad15e5e76abed3b26665e7")
!687 = !{!688, !690}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !686, file: !8, baseType: !689, size: 32, align: 32)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !91, size: 32, align: 32, dwarfAddressSpace: 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !686, file: !8, baseType: !691, size: 32, align: 32, offset: 32)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::task::wake::RawWakerVTable", baseType: !692, size: 32, align: 32, dwarfAddressSpace: 0)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawWakerVTable", scope: !682, file: !8, size: 128, align: 32, elements: !693, templateParams: !42, identifier: "91a2587b83a220382b9f1ec2568ac069")
!693 = !{!694, !698, !702, !703}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !692, file: !8, baseType: !695, size: 32, align: 32)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(*const ()) -> core::task::wake::RawWaker", baseType: !696, size: 32, align: 32, dwarfAddressSpace: 0)
!696 = !DISubroutineType(types: !697)
!697 = !{!686, !689}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "wake", scope: !692, file: !8, baseType: !699, size: 32, align: 32, offset: 32)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(*const ())", baseType: !700, size: 32, align: 32, dwarfAddressSpace: 0)
!700 = !DISubroutineType(types: !701)
!701 = !{null, !689}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "wake_by_ref", scope: !692, file: !8, baseType: !699, size: 32, align: 32, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "drop", scope: !692, file: !8, baseType: !699, size: 32, align: 32, offset: 96)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !706, isLocal: true, isDefinition: true)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !689, identifier: "vtable")
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !709, isLocal: true, isDefinition: true)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !710, identifier: "vtable")
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::task::wake::RawWakerVTable", baseType: !692, size: 32, align: 32, dwarfAddressSpace: 0)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !713, isLocal: true, isDefinition: true)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !714, identifier: "vtable")
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[u8]", baseType: !519, size: 32, align: 32, dwarfAddressSpace: 0)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !717, isLocal: true, isDefinition: true)
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !718, identifier: "vtable")
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i64", baseType: !719, size: 32, align: 32, dwarfAddressSpace: 0)
!719 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !722, isLocal: true, isDefinition: true)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !723, identifier: "vtable")
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::num::dec2flt::parse::Decimal", baseType: !724, size: 32, align: 32, dwarfAddressSpace: 0)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "Decimal", scope: !165, file: !8, size: 192, align: 32, elements: !725, templateParams: !42, identifier: "5111ac39dc4655742f1161e46560d223")
!725 = !{!726, !727, !728}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !724, file: !8, baseType: !519, size: 64, align: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "fractional", scope: !724, file: !8, baseType: !519, size: 64, align: 32, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !724, file: !8, baseType: !719, size: 64, align: 32, offset: 128)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !731, isLocal: true, isDefinition: true)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !732, identifier: "vtable")
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u64", baseType: !239, size: 32, align: 32, dwarfAddressSpace: 0)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !735, isLocal: true, isDefinition: true)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !736, identifier: "vtable")
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i16", baseType: !241, size: 32, align: 32, dwarfAddressSpace: 0)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !739, isLocal: true, isDefinition: true)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !740, identifier: "vtable")
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::num::dec2flt::FloatErrorKind", baseType: !140, size: 32, align: 32, dwarfAddressSpace: 0)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !743, isLocal: true, isDefinition: true)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !744, identifier: "vtable")
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !506, size: 32, align: 32, dwarfAddressSpace: 0)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !747, isLocal: true, isDefinition: true)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !748, identifier: "vtable")
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::num::flt2dec::decoder::Decoded", baseType: !749, size: 32, align: 32, dwarfAddressSpace: 0)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "Decoded", scope: !750, file: !8, size: 224, align: 32, elements: !751, templateParams: !42, identifier: "61ad61857d05374489c673d00a41027f")
!750 = !DINamespace(name: "decoder", scope: !170)
!751 = !{!752, !753, !754, !755, !756}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "mant", scope: !749, file: !8, baseType: !239, size: 64, align: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "minus", scope: !749, file: !8, baseType: !239, size: 64, align: 32, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "plus", scope: !749, file: !8, baseType: !239, size: 64, align: 32, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !749, file: !8, baseType: !241, size: 16, align: 16, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "inclusive", scope: !749, file: !8, baseType: !506, size: 8, align: 8, offset: 208)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !759, isLocal: true, isDefinition: true)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !760, identifier: "vtable")
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u16", baseType: !761, size: 32, align: 32, dwarfAddressSpace: 0)
!761 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !764, isLocal: true, isDefinition: true)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !628, identifier: "vtable")
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !767, isLocal: true, isDefinition: true)
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !768, identifier: "vtable")
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !91, size: 32, align: 32, dwarfAddressSpace: 0)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !771, isLocal: true, isDefinition: true)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !772, identifier: "vtable")
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::num::IntErrorKind", baseType: !146, size: 32, align: 32, dwarfAddressSpace: 0)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !775, isLocal: true, isDefinition: true)
!775 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !776, identifier: "vtable")
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::char::convert::CharErrorKind", baseType: !152, size: 32, align: 32, dwarfAddressSpace: 0)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !779, isLocal: true, isDefinition: true)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !780, identifier: "vtable")
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::char::EscapeUnicodeState", baseType: !131, size: 32, align: 32, dwarfAddressSpace: 0)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !783, isLocal: true, isDefinition: true)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !784, identifier: "vtable")
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::char::EscapeDefaultState", baseType: !318, size: 32, align: 32, dwarfAddressSpace: 0)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !787, isLocal: true, isDefinition: true)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !788, identifier: "vtable")
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::char::EscapeUnicode", baseType: !337, size: 32, align: 32, dwarfAddressSpace: 0)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !791, isLocal: true, isDefinition: true)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !792, identifier: "vtable")
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::char::EscapeDefault", baseType: !315, size: 32, align: 32, dwarfAddressSpace: 0)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !795, isLocal: true, isDefinition: true)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !796, identifier: "vtable")
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::char::CaseMappingIter", baseType: !797, size: 32, align: 32, dwarfAddressSpace: 0)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "CaseMappingIter", scope: !132, file: !8, size: 128, align: 32, elements: !798, identifier: "a1ad6444e50d9dd0bcf9ea10acf53ebd")
!798 = !{!799}
!799 = !DICompositeType(tag: DW_TAG_variant_part, scope: !132, file: !8, size: 128, align: 32, elements: !800, templateParams: !42, identifier: "a1ad6444e50d9dd0bcf9ea10acf53ebd_variant_part", discriminator: !343)
!800 = !{!801, !807, !812, !816}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "Three", scope: !799, file: !8, baseType: !802, size: 128, align: 32, extraData: i64 0)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "Three", scope: !797, file: !8, size: 128, align: 32, elements: !803, templateParams: !42, identifier: "a1ad6444e50d9dd0bcf9ea10acf53ebd::Three")
!803 = !{!804, !805, !806}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !802, file: !8, baseType: !328, size: 32, align: 32, offset: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !802, file: !8, baseType: !328, size: 32, align: 32, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !802, file: !8, baseType: !328, size: 32, align: 32, offset: 96)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "Two", scope: !799, file: !8, baseType: !808, size: 128, align: 32, extraData: i64 1)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "Two", scope: !797, file: !8, size: 128, align: 32, elements: !809, templateParams: !42, identifier: "a1ad6444e50d9dd0bcf9ea10acf53ebd::Two")
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !808, file: !8, baseType: !328, size: 32, align: 32, offset: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !808, file: !8, baseType: !328, size: 32, align: 32, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "One", scope: !799, file: !8, baseType: !813, size: 128, align: 32, extraData: i64 2)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "One", scope: !797, file: !8, size: 128, align: 32, elements: !814, templateParams: !42, identifier: "a1ad6444e50d9dd0bcf9ea10acf53ebd::One")
!814 = !{!815}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !813, file: !8, baseType: !328, size: 32, align: 32, offset: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "Zero", scope: !799, file: !8, baseType: !817, size: 128, align: 32, extraData: i64 3)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "Zero", scope: !797, file: !8, size: 128, align: 32, elements: !42, templateParams: !42, identifier: "a1ad6444e50d9dd0bcf9ea10acf53ebd::Zero")
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !820, isLocal: true, isDefinition: true)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !821, identifier: "vtable")
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::ffi::VaListImpl", baseType: !822, size: 32, align: 32, dwarfAddressSpace: 0)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "VaListImpl", scope: !127, file: !8, size: 32, align: 32, elements: !823, templateParams: !42, identifier: "b5922a24e7f059d36f4a91d6e5cdbdcc")
!823 = !{!824, !826}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !822, file: !8, baseType: !825, size: 32, align: 32)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::ffi::c_void", baseType: !126, size: 32, align: 32, dwarfAddressSpace: 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !822, file: !8, baseType: !827, align: 8)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&mut &core::ffi::c_void>", scope: !287, file: !8, align: 8, elements: !42, templateParams: !828, identifier: "82d3923cf488a6ded9c2aa068f07a1fa")
!828 = !{!829}
!829 = !DITemplateTypeParameter(name: "T", type: !830)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut &core::ffi::c_void", baseType: !831, size: 32, align: 32, dwarfAddressSpace: 0)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::ffi::c_void", baseType: !126, size: 32, align: 32, dwarfAddressSpace: 0)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !834, isLocal: true, isDefinition: true)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !835, identifier: "vtable")
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::marker::PhantomData<&mut core::ffi::VaListImpl>", baseType: !836, size: 32, align: 32, dwarfAddressSpace: 0)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&mut core::ffi::VaListImpl>", scope: !287, file: !8, align: 8, elements: !42, templateParams: !837, identifier: "9f4317d71fecec6710f139c013ca857")
!837 = !{!838}
!838 = !DITemplateTypeParameter(name: "T", type: !839)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::ffi::VaListImpl", baseType: !822, size: 32, align: 32, dwarfAddressSpace: 0)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !842, isLocal: true, isDefinition: true)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !843, identifier: "vtable")
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<core::iter::adapters::flatten::Flatten<core::option::IntoIter<core::char::EscapeDebug>>>", baseType: !844, size: 32, align: 32, dwarfAddressSpace: 0)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::iter::adapters::flatten::Flatten<core::option::IntoIter<core::char::EscapeDebug>>>", scope: !259, file: !8, size: 384, align: 32, elements: !845, identifier: "699cc57ec66d1bb2b3120b883e4e1b2d")
!845 = !{!846}
!846 = !DICompositeType(tag: DW_TAG_variant_part, scope: !259, file: !8, size: 384, align: 32, elements: !847, templateParams: !850, identifier: "699cc57ec66d1bb2b3120b883e4e1b2d_variant_part", discriminator: !859)
!847 = !{!848, !855}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !846, file: !8, baseType: !849, size: 384, align: 32, extraData: i64 5)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !844, file: !8, size: 384, align: 32, elements: !42, templateParams: !850, identifier: "699cc57ec66d1bb2b3120b883e4e1b2d::None")
!850 = !{!851}
!851 = !DITemplateTypeParameter(name: "T", type: !852)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flatten<core::option::IntoIter<core::char::EscapeDebug>>", scope: !249, file: !8, size: 384, align: 32, elements: !853, templateParams: !472, identifier: "c692d1810a19e7d2b32026fc337d033a")
!853 = !{!854}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !852, file: !8, baseType: !446, size: 384, align: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !846, file: !8, baseType: !856, size: 384, align: 32)
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !844, file: !8, size: 384, align: 32, elements: !857, templateParams: !850, identifier: "699cc57ec66d1bb2b3120b883e4e1b2d::Some")
!857 = !{!858}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !856, file: !8, baseType: !852, size: 384, align: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, scope: !259, file: !8, baseType: !203, size: 32, align: 32, offset: 128, flags: DIFlagArtificial)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !862, isLocal: true, isDefinition: true)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !863, identifier: "vtable")
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<core::iter::adapters::flatten::FlatMap<core::str::Chars, core::char::EscapeDebug, core::str::CharEscapeDebugContinue>>", baseType: !864, size: 32, align: 32, dwarfAddressSpace: 0)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::iter::adapters::flatten::FlatMap<core::str::Chars, core::char::EscapeDebug, core::str::CharEscapeDebugContinue>>", scope: !259, file: !8, size: 320, align: 32, elements: !865, identifier: "68ebf6562ebe6d06dad817ec332162d3")
!865 = !{!866}
!866 = !DICompositeType(tag: DW_TAG_variant_part, scope: !259, file: !8, size: 320, align: 32, elements: !867, templateParams: !870, identifier: "68ebf6562ebe6d06dad817ec332162d3_variant_part", discriminator: !880)
!867 = !{!868, !876}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !866, file: !8, baseType: !869, size: 320, align: 32, extraData: i64 5)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !864, file: !8, size: 320, align: 32, elements: !42, templateParams: !870, identifier: "68ebf6562ebe6d06dad817ec332162d3::None")
!870 = !{!871}
!871 = !DITemplateTypeParameter(name: "T", type: !872)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "FlatMap<core::str::Chars, core::char::EscapeDebug, core::str::CharEscapeDebugContinue>", scope: !249, file: !8, size: 320, align: 32, elements: !873, templateParams: !875, identifier: "87ea7298dc6e8d68b0c9a58b1226c077")
!873 = !{!874}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !872, file: !8, baseType: !248, size: 320, align: 32)
!875 = !{!294, !350, !295}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !866, file: !8, baseType: !877, size: 320, align: 32)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !864, file: !8, size: 320, align: 32, elements: !878, templateParams: !870, identifier: "68ebf6562ebe6d06dad817ec332162d3::Some")
!878 = !{!879}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !877, file: !8, baseType: !872, size: 320, align: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, scope: !259, file: !8, baseType: !203, size: 32, align: 32, offset: 64, flags: DIFlagArtificial)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !883, isLocal: true, isDefinition: true)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !884, identifier: "vtable")
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::iter::adapters::fuse::Fuse<core::iter::adapters::Map<core::str::Chars, core::str::CharEscapeDefault>>", baseType: !357, size: 32, align: 32, dwarfAddressSpace: 0)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !887, isLocal: true, isDefinition: true)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !888, identifier: "vtable")
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<core::char::EscapeDefault>", baseType: !382, size: 32, align: 32, dwarfAddressSpace: 0)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !891, isLocal: true, isDefinition: true)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !892, identifier: "vtable")
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::iter::adapters::fuse::Fuse<core::iter::adapters::Map<core::str::Chars, core::str::CharEscapeDebugContinue>>", baseType: !254, size: 32, align: 32, dwarfAddressSpace: 0)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !895, isLocal: true, isDefinition: true)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !896, identifier: "vtable")
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<core::char::EscapeDebug>", baseType: !304, size: 32, align: 32, dwarfAddressSpace: 0)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !899, isLocal: true, isDefinition: true)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !900, identifier: "vtable")
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::iter::adapters::fuse::Fuse<core::option::IntoIter<core::char::EscapeDebug>>", baseType: !449, size: 32, align: 32, dwarfAddressSpace: 0)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !903, isLocal: true, isDefinition: true)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !904, identifier: "vtable")
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::iter::adapters::fuse::Fuse<core::iter::adapters::Map<core::str::Chars, core::str::CharEscapeUnicode>>", baseType: !403, size: 32, align: 32, dwarfAddressSpace: 0)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !907, isLocal: true, isDefinition: true)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !908, identifier: "vtable")
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<core::char::EscapeUnicode>", baseType: !428, size: 32, align: 32, dwarfAddressSpace: 0)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !911, isLocal: true, isDefinition: true)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !8, align: 32, flags: DIFlagArtificial, elements: !42, vtableHolder: !912, identifier: "vtable")
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<core::iter::adapters::Map<core::str::Chars, core::str::CharEscapeDefault>>", baseType: !360, size: 32, align: 32, dwarfAddressSpace: 0)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !8, type: !915, isLocal: true, isDefinition: true)
